# Taps
tap 'homebrew/cask-versions'
tap 'stripe/stripe-cli'
tap 'oven-sh/bun'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'bat' # Used for spatie/visit
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'grep'
brew 'httpie'
brew 'jq' # Used for spatie/visit
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'stripe/stripe-cli/stripe'

# Spatie Medialibrary
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'

# Development
brew 'imagemagick'
brew 'yarn'

# JS/TS toolchain (Node itself comes from Herd's NVM)
brew 'pnpm'
brew 'oven-sh/bun/bun'

# Python toolchain
brew 'uv'   # fast Python package/project manager
brew 'ruff' # linter/formatter

# Modern CLI quality-of-life (great for both humans and AI agents)
brew 'ripgrep'   # rg — fast search
brew 'fd'        # friendlier find
brew 'fzf'       # fuzzy finder
brew 'eza'       # modern ls
brew 'zoxide'    # smarter cd
brew 'git-delta' # better git diffs
brew 'lazygit'   # git TUI
brew 'direnv'    # per-directory env (.envrc)
brew 'tldr'      # concise man pages
brew 'starship'  # cross-shell prompt

# AI / agents
brew 'gemini-cli' # Google Gemini CLI

# Apps
cask '1password'
brew '1password-cli'
cask 'antigravity-cli'
cask 'caffeine'
cask 'claude'
cask 'claude-code'
cask 'cleanshot'
cask 'codex'
cask 'codex-app'
cask 'copilot-cli'
cask 'cursor'
cask 'cursor-cli'
cask 'cyberduck'
cask 'discord'
cask 'docker'
cask 'figma'
cask 'firefox'
cask 'ghostty' # fast, native Metal terminal (best for AI-CLI workflows)
cask 'github'
cask 'google-chrome'
cask 'helo'
cask 'herd'
cask 'httpie'
cask 'imageoptim'
cask 'loom'
cask 'pastebot'
cask 'reflex'
cask 'screen-studio'
cask 'slack'
cask 'tableplus'
cask 'telegram-desktop'
cask 'the-unarchiver'
cask 'tinkerwell'
cask 'transmit'
cask 'tunnelbear'
cask 'tuple'
cask 'visual-studio-code'
cask 'zoom'

# Mac App Store
mas 'Keynote', id: 409183694
mas 'MyWoosh', id: 1498889644
mas 'Numbers', id: 409203825
mas 'Speedtest', id: 1153157709
