# Taps
tap 'stripe/stripe-cli'
tap 'oven-sh/bun'
tap 'manaflow-ai/cmux' # for the cmux cask below

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'bat' # Used for spatie/visit
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'grep'
brew 'httpie'
brew 'jq' # Used for spatie/visit
brew 'mackup'
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'stripe/stripe-cli/stripe'

# Spatie Medialibrary
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'

# Development
brew 'imagemagick'
brew 'yarn'

# JS/TS toolchain (Node itself comes from Herd's NVM)
brew 'pnpm'
brew 'oven-sh/bun/bun'

# Python toolchain
brew 'uv'   # fast Python package/project manager
brew 'ruff' # linter/formatter

# Zsh enhancements
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'
brew 'zsh-you-should-use' # nudges you toward your aliases when you type the long form

# Modern CLI quality-of-life (great for both humans and AI agents)
brew 'ripgrep'   # rg — fast search
brew 'fd'        # friendlier find
brew 'fzf'       # fuzzy finder
brew 'eza'       # modern ls
brew 'zoxide'    # smarter cd
brew 'git-delta' # better git diffs
brew 'lazygit'   # git TUI
brew 'lefthook'  # fast, parallel git hooks (format/lint on commit)
brew 'direnv'    # per-directory env (.envrc)
brew 'tldr'      # concise man pages
brew 'starship'  # cross-shell prompt

# Terminal candy + extra modern CLI (nerdy & useful)
brew 'atuin'      # magical shell history (full-screen fuzzy Ctrl-R)
brew 'fastfetch'  # system-info splash on shell start
brew 'btop'       # gorgeous resource monitor
brew 'yazi'       # blazing TUI file manager
brew 'zellij'     # terminal multiplexer (persistent split sessions)
brew 'glow'       # render markdown in the terminal
brew 'jless'      # JSON/YAML viewer
brew 'dust'       # du, but pretty
brew 'duf'        # df, but pretty
brew 'procs'      # ps, but pretty
brew 'sd'         # sed, but simple
brew 'gping'      # ping with a live graph
brew 'sevenzip'   # archives (also a yazi preview dep)
brew 'poppler'    # PDF previews for yazi
brew 'lolcat'     # rainbow text (pipe into it for fun)
brew 'cmatrix'    # matrix rain (pure eye-candy)

# AI / agents
brew 'gemini-cli' # Google Gemini CLI

# Apps
cask 'antigravity-cli'
cask 'caffeine'
cask 'claude'
cask 'claude-code'
cask 'cleanshot'
cask 'cmux' # Ghostty-based terminal for running AI coding agents in parallel
cask 'codex'
cask 'codex-app'
cask 'copilot-cli'
cask 'cursor'
cask 'cursor-cli'
cask 'cyberduck'
cask 'discord'
cask 'docker'
cask 'figma'
cask 'firefox'
cask 'font-jetbrains-mono-nerd-font' # prompt/terminal glyphs (Starship icons)
cask 'ghostty' # fast, native Metal terminal (best for AI-CLI workflows)
cask 'github'
cask 'google-chrome'
cask 'helo'
cask 'herd'
cask 'httpie'
cask 'imageoptim'
cask 'loom'
cask 'maestro' # RunMaestro.ai — AI agent command center
cask 'pastebot'
cask 'raycast' # launcher: window mgmt, clipboard, snippets, AI
cask 'reflex'
cask 'screen-studio'
cask 'sequel-ace' # MySQL/MariaDB GUI
cask 'slack'
cask 'tableplus'
cask 'telegram-desktop'
cask 'the-unarchiver'
cask 'tinkerwell'
cask 'transmit'
cask 'tunnelbear'
cask 'tuple'
cask 'warp' # AI-powered terminal
cask 'zed' # primary GUI editor
cask 'zoom'
