# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'exolnet/homebrew-deprecated'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'bat' # "cat" on steroids
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'gnupg2'
brew 'grep'
brew 'httpie'
brew 'hub'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'tree' # List directories in a tree structure
brew 'zlib' # Needed for Memcached
brew 'fzf'
brew 'ack'
brew 'zsh-syntax-highlighting'
brew 'dos2unix'

# Spatie Medialibrary
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'

# Development
brew 'php'
brew 'php@7.3'
brew 'php@7.2'
brew 'composer'
brew 'imagemagick'
brew 'libmemcached'
brew 'memcached'
brew 'mysql'
brew 'nginx'
brew 'node'
brew 'redis'
brew 'yarn'

# Apps
cask 'alfred'
cask 'dbngin'
cask 'discord'
cask 'docker'
cask 'figma'
cask 'firefox'
cask 'firefox-developer-edition'
cask 'github'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'imageoptim'
cask 'phpstorm'
cask 'skype'
cask 'slack'
cask 'sublime-text'
cask 'sequel-pro-nightly'
cask 'tinkerwell'
cask 'tor-browser'
cask 'visual-studio-code'
cask 'vlc'
cask 'setapp'
cask 'iterm2'
cask 'microsoft-office'
cask 'anydesk'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
# mas signin --dialog hardikshahau@gmail.com
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'Spark', id: 1176895641
mas 'Swift Playground', id: 1496833156
mas 'Twitter', id: 1482454543
mas 'Pages', id: 409201541
